username = input("Ваше ім'я: ")
print(f"Дякую, ваше ім'я {username} було збережено")
email = input("Поштова скринька: ")
print(f"Дякую, вашу поштову скриньку {email} було збережено")
print("--------------------------------------------------")
exercises = ["присідання", "віджимання", "підтягування", "прижки"]
print("Доступні вправи у словнику:")
print(exercises)
exercise_number = int(input("Введи номер вправи (від 0 до 3): "))
print(f"Супер, ти вибрав: {exercises[exercise_number]}")
reps = int(input("Скільки повторень ти зробив? "))
print("--------------------------------------------------")
print(f"Круто, {username}! Ти щойно зробив {reps} повторень вправи {exercises[exercise_number]}")
if reps > 15:
    print("Крутий результат, так тримати!")
else:
    print("Хороша розминка, але наступного разу піднажмемо!")
